* Problems
  * [X] Images not working on production
* Tasks
** DONE Implement glassmorphism
** TODO PIXI animations
  SCHEDULED: <2023-08-31 Thu>
    * [ ] rotating icon countdown 
    * [ ] figure out what to do with the third tab
    * [ ] optimize each tab
    * [X] better scene management
** TODO Form handling
  * [X] frontend layout for the form
  * [X] better styling, make bg easier on the eye to read
  * [ ] form handling proper
  * [ ] basic backend to receive the messages
** TODO Styling general
  * [X] make default text color white 
  * [ ] host own font

* Time
  :LOGBOOK:
  CLOCK: <2023-09-07 Thu 23:46>--[2023-09-08 Fri 01:35] => 1:49
  CLOCK: [2023-09-07 Thu 22:02]--[2023-09-07 Thu 23:21] => 1:19
  CLOCK: [2023-09-06 Wed 21:00]--[2023-09-06 Wed 23:42] => 2:42
  CLOCK: [2023-09-06 Wed 18:46]--[2023-09-06 Wed 19:54] => 1:08
  CLOCK: [2023-09-06 Wed 14:44]--[2023-09-06 Wed 16:30] => 1:46
  CLOCK: [2023-09-05 Tue 21:23]--[2023-09-05 Tue 23:39] => 2:16
  CLOCK: [2023-09-05 Tue 15:26]--[2023-09-05 Tue 16:58] => 1:32
  CLOCK: [2023-09-03 Sun 17:54]--[2023-09-03 Sun 18:43] => 0:49
  CLOCK: [2023-09-03 Sun 15:30]--[2023-09-03 Sun 16:52] => 1:22
  CLOCK: [2023-09-03 Sun 12:47]--[2023-09-03 Sun 13:34] => 0:47
  CLOCK: [2023-08-29 Tue 21:50]--[2023-08-29 Tue 23:42] => 1:52
  CLOCK: [2023-08-29 Tue 17:15]--[2023-08-29 Tue 18:30] => 1:15
  CLOCK: [2023-08-29 Tue 13:27]--[2023-08-29 Tue 14:10] => 0:43
  CLOCK: [2023-08-25 Fri 22:42]--[2023-08-25 Fri 22:48] => 0:06
  :END:
   
